;*****************************************************************************;
;            Language set file for plugins used by NativeLang.dll             ;
;*****************************************************************************;
;                                                                             ;
; Please change the file and distribute to the corresponding developer.       ;
;                                                                             ;
;*****************************************************************************;


; Spell-Checker Language Set *************************** jens.plugin.npp@gmx.de
[SpellChecker.dll NppMenu]
Main="Recht&schreibkorrektur"
0="Recht&schreibkorrektur...%tStrg+Alt+Shift+S"
1="&Hilfe..."
2="Was kann ich tun...%tStrg+Alt+Shift+S"

[SpellChecker.dll Spell-Checker]
Caption="Rechtschreibkorrektur"
2="Abbrechen"
1102="&Lernen"
1103="&Ersetzen"
1104="&Ignorieren"
1105="&Alle ignorieren"
1109="Unbekannt:"
1110="Ersetzen durch:"
1111="Sprache:"

[SpellChecker.dll Help]
Caption="Hilfe"
1205="Entwickler:"
1206="eMail:"
1207="Installation:"
1208="Neue Updates und Plugins finden Sie unter:"
1209="Spell-Checker nutzt den GNU Aspell ein Open Source Produkt:"
1210="Menü Elemente"
1211="Rechtschreibkorrektur...%t Startet die Korrekturhilfe."
1212="Hilfe...%t%t%t Zeigt diesen Hilfe-Dialog an."

[SpellChecker.dll NotAvailable]
Caption="Was kann ich tun"
1302="GNU Aspell und/oder die Sprachdateien sind nicht installiert. Die Installationsprogramme finden Sie hier:"
1303="Wenn Aspell vorhanden ist tragen Sie hier den relativen Pfad zur aspell-15.dll ein und starten Sie Notepad++ neu:"

[SpellChecker.dll Text]
MsgBox RectMode="Korrekturhilfe im Block-Mode nicht verfügbar!%tRechtschreibkorrektur"
MsgBox Done="Rechtschreibkorrektur beendet%tRechtschreibkorrektur"
